## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_manifest.certificate_resource will be updated in-place
!   resource "kubernetes_manifest" "certificate_resource" {
!       manifest = {
!           spec       = {
!               secretName = "argocd-secret" -> "wayofthesys-org-tls"
                # (3 unchanged elements hidden)
            }
            # (3 unchanged elements hidden)
        }
!       object   = {
!           spec       = {
!               secretName              = "argocd-secret" -> "wayofthesys-org-tls"
                # (18 unchanged elements hidden)
            }
            # (3 unchanged elements hidden)
        }
    }

  # kubernetes_secret.argocd-tls must be replaced
-/+ resource "kubernetes_secret" "argocd-tls" {
!       id        = "cert-manager/wayofthesys-org-tls" -> (known after apply)
-       immutable = false -> null
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 0 -> (known after apply)
-           labels           = {} -> null
            name             = "wayofthesys-org-tls"
!           namespace        = "cert-manager" -> "argocd" # forces replacement
!           resource_version = "7012" -> (known after apply)
!           uid              = "d517f707-2426-47d5-8fd4-cea3ca97cd77" -> (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
